Revit 2027 API
ViewSchedule.KeyScheduleParameterName Property
 In a key schedule, the name of the parameter for choosing one of the keys.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string KeyScheduleParameterName { get; set; }
Public Property KeyScheduleParameterName As String
	Get
	Set
public:
property String^ KeyScheduleParameterName {
	String^ get ();
	void set (String^ value);
}
member KeyScheduleParameterName : string with get, set
Property Value
String
 The name of the key schedule parameter.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  This ViewSchedule is not key schedule.
ModificationForbiddenException |  When setting this property: The document containing this ViewSchedule is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- When setting this property: The document containing this ViewSchedule is being loaded, or is in the midst of another sensitive process. -or- When setting this property: This ViewSchedule is an internal element, such as a component of a loaded family or a group type. -or- When setting this property: The document containing this ViewSchedule is in Group Edit Mode, Sketch Edit Mode, or Paste Mode, and the element is not a member of the group, sketch, or clipboard. -or- When setting this property: This ViewSchedule is a member of a group or sketch, and the document is not currently editing the group or sketch.
ModificationOutsideTransactionException |  When setting this property: The document containing this ViewSchedule has no open transaction.
Remarks
 When a key schedule is created, elements of the schedule's category receive a new parameter for choosing one of the keys defined in the key schedule. This is the name of that parameter.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace